q61org/CH559sdccUSBHost/USBHost.c
void pollHIDdevice()
{
	 __xdata unsigned char s, hiddevice, len;
	for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
	{
		if(HIDdevice[hiddevice].connected){
		selectHubPort(HIDdevice[hiddevice].rootHub, 0);
		s = hostTransfer( USB_PID_IN << 4 | HIDdevice[hiddevice].endPoint & 0x7F, HIDdevice[hiddevice].endPoint & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );
		if ( s == ERR_SUCCESS )
   		{
    		HIDdevice[hiddevice].endPoint ^= 0x80;
			len = USB_RX_LEN;
			if ( len )
			{		
				LED = !LED;	
				//DEBUG_OUT("HID %lu, %i data %i : ", HIDdevice[hiddevice].type, hiddevice, HIDdevice[hiddevice].endPoint & 0x7F);
				sendHidPollMSG(MSG_TYPE_DEVICE_POLL,len, HIDdevice[hiddevice].type, hiddevice, HIDdevice[hiddevice].endPoint & 0x7F, RxBuffer,VendorProductID[HIDdevice[hiddevice].rootHub].idVendorL,VendorProductID[HIDdevice[hiddevice].rootHub].idVendorH,VendorProductID[HIDdevice[hiddevice].rootHub].idProductL,VendorProductID[HIDdevice[hiddevice].rootHub].idProductH);
			}
		}
		}
	}
}

int8_t FTDIReceive(uint8_t *dst, uint8_t maxlen)
{
	 __xdata unsigned char s, len;
	if (!FTDIDevice.connected) return -1;

	selectHubPort(FTDIDevice.rootHub, 0);
	s = hostTransfer(USB_PID_IN << 4 | FTDIDevice.ep_in & 0x7f, FTDIDevice.toggle_in ? bUH_R_TOG | bUH_T_TOG : 0, 0);
	if (s == ERR_SUCCESS) {
		FTDIDevice.toggle_in ^= 1;
		len = USB_RX_LEN;
		if (len > 2) {
			DEBUG_OUT("FTDI recv: rcvd %d bytes data: ", len);
			DEBUG_OUT_USB_BUFFER_LEN(RxBuffer, len);
		}
		len -= 2;
		if (len > maxlen) len = maxlen;
		for (uint8_t i = 0; i < len; i++) {
			dst[i] = RxBuffer[2 + i];
		}
		return len;
	} else if (s != 42) {
		DEBUG_OUT("FTDI recv: error %d\n", s);
		return -1;
	}
	return 0;
}

int8_t FTDISend(const uint8_t *src, uint8_t len)
{
	 __xdata unsigned char s;
	if (!FTDIDevice.connected) return -1;

	selectHubPort(FTDIDevice.rootHub, 0);
	fillTxBuffer_generic(src, len);
	UH_TX_LEN = len;
	s = hostTransfer(USB_PID_OUT << 4 | FTDIDevice.ep_out & 0x7f, FTDIDevice.toggle_out ? bUH_R_TOG | bUH_T_TOG : 0, 0);
	if (s == ERR_SUCCESS) {
		FTDIDevice.toggle_out ^= 1;
		len = UH_TX_LEN;
		DEBUG_OUT("FTDI send: sent %d bytes data: ", len);
		DEBUG_OUT_USB_BUFFER_LEN(TxBuffer, len);
		return len;
	} else if (s != 42) {
		DEBUG_OUT("FTDI send: error %d\n", s);
		return -1;
	}
	return 0;
}

unsigned char FTDISetBaudRate(uint32_t baud)
{
	uint16_t baud_value, baud_index = 0;
	uint32_t divisor3 = 48000000 / 2 / baud;
	static const uint8_t divfrac [8] = {0, 3, 2, 0, 1, 1, 2, 3};
    static const uint8_t divindex[8] = {0, 0, 0, 1, 0, 1, 1, 1};

    baud_value = divisor3 >> 3;
    baud_value |= divfrac [divisor3 & 0x7] << 14;
    baud_index = divindex[divisor3 & 0x7];

    /* Deal with special cases for highest baud rates. */
    if(baud_value == 1) baud_value = 0;
    else // 1.0
        if(baud_value == 0x4001) baud_value = 1; // 1.5
	
	DEBUG_OUT("FTDISetBaudRate: baud=%ld value=%d index=%d\n", baud, baud_value, baud_index);

	unsigned short len;
	fillTxBuffer(FTDISetBaudRateRequest, sizeof(FTDISetBaudRateRequest));
	TxBuffer[2] = baud_value & 0x0ff;
	TxBuffer[3] = baud_value >> 8;
	TxBuffer[4] = baud_index & 0x0ff;
	
	selectHubPort(FTDIDevice.rootHub, 0);
	unsigned char s = hostCtrlTransfer(receiveDataBuffer, &len, 0);
	if (s == ERR_SUCCESS) {
		DEBUG_OUT("FTDISetBaudRate: success.\n");
	} else {
		DEBUG_OUT("FTDISetBaudRate: error %d\n", s);
	}
	return s;
}

unsigned char FTDISetLatencyTimer(uint8_t timer)
{
	DEBUG_OUT("FTDISetLatencyTimer: %d\n", timer);

	unsigned short len;
	fillTxBuffer(FTDISetLatencyTimerRequest, sizeof(FTDISetLatencyTimerRequest));
	TxBuffer[2] = timer;
	
	selectHubPort(FTDIDevice.rootHub, 0);
	unsigned char s = hostCtrlTransfer(receiveDataBuffer, &len, 0);
	if (s == ERR_SUCCESS) {
		DEBUG_OUT("FTDISetLatencyTimer: success.\n");
	} else {
		DEBUG_OUT("FTDISetLatencyTimer: error %d\n", s);
	}
	return s;
}

uint8_t FTDIIsConnected()
{
	return FTDIDevice.connected;
}

void parseHIDDeviceReport(unsigned char __xdata *report, unsigned short length, unsigned char CurrentDevive)
{
	unsigned short i = 0;
	unsigned char level = 0;
	unsigned char isUsageSet = 0;
	while(i < length)
	{
		unsigned char j;
		unsigned char id = report[i] & 0b11111100;
		unsigned char size = report[i] & 0b00000011;
		unsigned long data = 0;
		if(size == 3) size++;
		for(j = 0; j < size; j++)
			data |= ((unsigned long)report[i + 1 + j]) << (j * 8);
		for(j = 0; j < level - (id == REPORT_COLLECTION_END ? 1 : 0); j++)
			DEBUG_OUT("    ");
		switch(id)
		{
			case REPORT_USAGE_PAGE:	//todo clean up defines (case)
			{
				unsigned long vd = data < REPORT_USAGE_PAGE_VENDOR ? data : REPORT_USAGE_PAGE_VENDOR;
				DEBUG_OUT("Usage page ");
				switch(vd)
				{
					case REPORT_USAGE_PAGE_LEDS:
						DEBUG_OUT("LEDs");
					break;
					case REPORT_USAGE_PAGE_KEYBOARD:
						DEBUG_OUT("Keyboard/Keypad");
					break;
					case REPORT_USAGE_PAGE_BUTTON:
						DEBUG_OUT("Button");
					break;
					case REPORT_USAGE_PAGE_GENERIC:
						DEBUG_OUT("generic desktop controls");
					break;
					case REPORT_USAGE_PAGE_VENDOR:
						DEBUG_OUT("vendor defined 0x%04lx", data);
					break;
					default:
						DEBUG_OUT("unknown 0x%02lx", data);
				}
				DEBUG_OUT("\n");
			}
			break;
			case REPORT_USAGE:
				if (!isUsageSet){
					HIDdevice[CurrentDevive].type = data;
					isUsageSet = 1;
				}
				DEBUG_OUT("Usage ");
				switch(data)
				{
					case REPORT_USAGE_UNKNOWN:
						DEBUG_OUT("Unknown");
					break;
					case REPORT_USAGE_POINTER:
						DEBUG_OUT("Pointer");
					break;
					case REPORT_USAGE_MOUSE:
						DEBUG_OUT("Mouse");
					break;
					case REPORT_USAGE_RESERVED:
						DEBUG_OUT("Reserved");
					break;
					case REPORT_USAGE_JOYSTICK:
						DEBUG_OUT("Joystick");
					break;
					case REPORT_USAGE_GAMEPAD:
						DEBUG_OUT("Gamepad");
					break;
					case REPORT_USAGE_KEYBOARD:
						DEBUG_OUT("Keyboard");
					break;
					case REPORT_USAGE_KEYPAD:
						DEBUG_OUT("Keypad");
					break;
					case REPORT_USAGE_MULTI_AXIS:
						DEBUG_OUT("Multi-Axis controller");
					break;
					case REPORT_USAGE_SYSTEM:
						DEBUG_OUT("Tablet system controls");
					break;

